app/views/book_comments/_comment.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
<div>
<p>コメント件数：<%= book.book_comments.count %></p>
<% book.book_comments.each do |book_comment| %>