app/views/books/_index.html.erb

        <td><%= render 'favorites/favorite', book: book %></td>
        <td><%= link_to "コメント：#{book.book_comments.count}", book_path(book.id) %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]