app/views/books/show.html.erb

          <td><%= render 'book_comments/comment', book: @book, book_comment: @book_comment %></td>
          <td><%= link_to "コメント数:#{@book.book_comments.count}", book_path(@book.id) %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]