app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @books = Book.new
    @book = Book.find(params[:id])